# Notebook with procedure and answers
- Author: José Roberto Pérez
- Date: 26/Jun/2021

## Imports

#### Standard library imports

In [3]:
import sys

#### Third party imports

In [2]:
import pandas as pd

#### Local application imports

In [4]:
sys.path.append("../")

In [5]:
%load_ext autoreload
%autoreload 2

---

## Importing data and initial cleaning

### Clients

#### Creating dataframe

In [6]:
dfc = pd.read_csv("../data/cliente_tabla.csv")

In [7]:
dfc

        Cliente_ID                            NombreCliente
0                0                               SIN NOMBRE
1                1                         OXXO XINANTECATL
2                2                               SIN NOMBRE
3                3                                EL MORENO
4                4  SDN SER  DE ALIM  CUERPO SA CIA  DE INT
...            ...                                      ...
935357    11011586                               OXXO PETEN
935358    11693264                     SUPER ABARROTES MARY
935359    19988629                          NO IDENTIFICADO
935360    99999999                          NO IDENTIFICADO
935361  2015152015                          NO IDENTIFICADO

[935362 rows x 2 columns]

In [12]:
dfc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 935362 entries, 0 to 935361
Data columns (total 2 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Cliente_ID     935362 non-null  int64
 1   NombreCliente  935362 non-null  object
dtypes: int64(1), object(1)
memory usage: 14.3+ MB

#### Eliminating duplicate client IDs

In [15]:
## Counting number of unique ID's
dfx = dfc["Cliente_ID"].value_counts().to_frame()
dfx

         Cliente_ID
544701            2
19703             2
292628            2
1896182           2
12732             2
...             ...
2415040           1
4510145           1
4508098           1
324037            1
2047              1

[930500 rows x 1 columns]

In [16]:
## Counting unique and duplicated id's
dfx.value_counts()

Cliente_ID
1             925638
2               4862
dtype: int64

In [23]:
## List with duplicated id's
lx = list(dfx[dfx["Cliente_ID"] > 1].index)

In [26]:
## Filtering duplicated id's
dfc[dfc["Cliente_ID"].isin(lx)]

        Cliente_ID                            NombreCliente
4                4  SDN SER  DE ALIM  CUERPO SA CIA  DE INT
5                4     SDN SER DE ALIM CUERPO SA CIA DE INT
62             262        BALNEARIO IXTAPAN S DE R L DE C V
63             262      BALNEARIO IXTAPAN S  DE R L  DE C V
64             465                ESCUELA PREPARAROTIA NO 5
...            ...                                      ...
932959     9533930      SERVIFARMACIAS PACIFICO S A  DE C V
933798     9612023             GRUPO FERMOSELLE S A  DE C V
933799     9612023              GRUPO FERMOSELLE S A DE C V
934732     9694173                            OXXO DR  COSS
934733     9694173                             OXXO DR COSS

[9724 rows x 2 columns]

In [41]:
9724/2

4862.0

In [38]:
## Eliminating entries with duplicated id's
dfc.drop_duplicates(subset=["Cliente_ID"], inplace=True)

#### Resulting dataframe

In [39]:
dfc

        Cliente_ID                            NombreCliente
0                0                               SIN NOMBRE
1                1                         OXXO XINANTECATL
2                2                               SIN NOMBRE
3                3                                EL MORENO
4                4  SDN SER  DE ALIM  CUERPO SA CIA  DE INT
...            ...                                      ...
935357    11011586                               OXXO PETEN
935358    11693264                     SUPER ABARROTES MARY
935359    19988629                          NO IDENTIFICADO
935360    99999999                          NO IDENTIFICADO
935361  2015152015                          NO IDENTIFICADO

[930500 rows x 2 columns]

### Products

#### Creating dataframe

In [8]:
dfp = pd.read_csv("../data/producto_tabla.csv")

In [9]:
dfp

      Producto_ID                                  NombreProducto
0               0                               NO IDENTIFICADO 0
1               9                       Capuccino Moka 750g NES 9
2              41          Bimbollos Ext sAjonjoli 6p 480g BIM 41
3              53                  Burritos Sincro 170g CU LON 53
4              72             Div Tira Mini Doradita 4p 45g TR 72
...           ...                                             ...
2587        49992             Tostado Integral 180g MTA WON 49992
2588        49993             Tostado Integral 180g TAB WON 49993
2589        49994      Tostado Int 0pct Grasa Azuc 200g WON 49994
2590        49996  Tostado Int 0pct Grasa Azuc 200g MTA WON 49996
2591        49997  Tostado Int 0pct Grasa Azuc 200g TAB WON 49997

[2592 rows x 2 columns]

In [40]:
dfp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2592 entries, 0 to 2591
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Producto_ID     2592 non-null   int64
 1   NombreProducto  2592 non-null   object
dtypes: int64(1), object(1)
memory usage: 40.6+ KB

### Locations

In [10]:
dfl = pd.read_csv("../data/town_state_small.csv")

In [11]:
dfl

    Agencia_ID                                   Town             State
0         1110                     2008 AG. LAGO FILT      MÉXICO, D.F.
1         1111                  2002 AG. AZCAPOTZALCO      MÉXICO, D.F.
2         1112                    2004 AG. CUAUTITLAN  ESTADO DE MÉXICO
3         1113                     2008 AG. LAGO FILT      MÉXICO, D.F.
4         1114                   2029 AG.IZTAPALAPA 2      MÉXICO, D.F.
5         1116                   2011 AG. SAN ANTONIO      MÉXICO, D.F.
6         1117                      2001 AG. ATIZAPAN  ESTADO DE MÉXICO
7         1118                      2007 AG. LA VILLA      MÉXICO, D.F.
8         1119                2013 AG. MEGA NAUCALPAN  ESTADO DE MÉXICO
9         1120                  2018 AG. TEPALCATES 2      MÉXICO, D.F.
10        1121                   2016 AG. SAN LORENZO      MÉXICO, D.F.
11        1122                      2019 AG. XALOSTOC  ESTADO DE MÉXICO
12        1123                         2094 CHALCO_BM  ESTADO DE MÉXICO
13        1124                  2021 AG. XOCHIMILCO 2      MÉXICO, D.F.
14        1126                   2017 AG. SANTA CLARA  ESTADO DE MÉXICO
15        1127                      2003 AG. COACALCO  ESTADO DE MÉXICO
16        1129                   2011 AG. SAN ANTONIO      MÉXICO, D.F.
17        1130                     2010 AG. LOS REYES  ESTADO DE MÉXICO
18        1137                          2014 AG. NEZA  ESTADO DE MÉXICO
19        1138                    2015 AG. ROJO GOMEZ      MÉXICO, D.F.
20        1139                2013 AG. MEGA NAUCALPAN  ESTADO DE MÉXICO
21        1140                       2078 AG. TEXCOCO  ESTADO DE MÉXICO
22        1142                2013 AG. MEGA NAUCALPAN  ESTADO DE MÉXICO
23        1143                        2088 AG. CEYLAN      MÉXICO, D.F.
24        1146                        2088 AG. CEYLAN      MÉXICO, D.F.
25        1147                      2003 AG. COACALCO  ESTADO DE MÉXICO
26        1150                   2011 AG. SAN ANTONIO      MÉXICO, D.F.
27        1152                     2008 AG. LAGO FILT      MÉXICO, D.F.
28        1153                      2087 AG. TIZAYUCA           HIDALGO
29        1155                      2003 AG. COACALCO  ESTADO DE MÉXICO
30        1156                  2018 AG. TEPALCATES 2      MÉXICO, D.F.
31        1159                   2011 AG. SAN ANTONIO      MÉXICO, D.F.
32        1160  2089 AG. AZCAPOTZALCO INSTITUCIONALES      MÉXICO, D.F.
33        1164                  2048 AG. IXTAPALUCA 1  ESTADO DE MÉXICO
34        1165                     2010 AG. LOS REYES  ESTADO DE MÉXICO
35        1167      2116 Cruce De Anden Región Mexico  ESTADO DE MÉXICO
36        1168     2092 AG. SANTA CLARA AUTOSERVICIOS  ESTADO DE MÉXICO
37        1170                      2001 AG. ATIZAPAN  ESTADO DE MÉXICO
38        1171                      2001 AG. ATIZAPAN  ESTADO DE MÉXICO
39        1172                    2004 AG. CUAUTITLAN  ESTADO DE MÉXICO
40        1173                    2004 AG. CUAUTITLAN  ESTADO DE MÉXICO

### Training data

In [42]:
dftr = pd.read_csv("../data/df_[candidate]_small.csv")

In [43]:
dftr

,Semana,Agencia_ID,Canal_ID,Ruta_SAK,Cliente_ID,Producto_ID,Venta_uni_hoy,Venta_hoy,Dev_uni_proxima,Dev_proxima,Demanda_uni_equil
0,3,1110,7,3301,15766,1212,3,25.14,0,0.0,3
1,3,1110,7,3301,15766,1216,4,33.52,0,0.0,4
2,3,1110,7,3301,15766,1238,4,39.32,0,0.0,4
3,3,1110,7,3301,15766,1240,4,33.52,0,0.0,4
4,3,1110,7,3301,15766,1242,3,22.92,0,0.0,3
...,...,...,...,...,...,...,...,...,...,...,...
7974413,8,1173,4,6609,4549706,1242,2,15.40,0,0.0,2
7974414,8,1173,4,6609,4549706,5310,12,60.48,0,0.0,12
7974415,8,1173,4,6609,4549706,40447,10,108.00,0,0.0,10
7974416,8,1173,4,6609,4549706,40450,18,331.20,0,0.0,18
7974417,8,1173,4,6609,4549706,46772,16,150.40,0,0.0,16

In [47]:
dftr[dftr["Dev_uni_proxima"] > 0]

,Semana,Agencia_ID,Canal_ID,Ruta_SAK,Cliente_ID,Producto_ID,Venta_uni_hoy,Venta_hoy,Dev_uni_proxima,Dev_proxima,Demanda_uni_equil
91,3,1110,7,3301,198780,1187,0,0.00,2,297.00,0
117,3,1110,7,3301,319641,47611,2,34.30,1,17.15,1
230,3,1110,7,3301,1307034,739,0,0.00,2,166.00,0
284,3,1110,7,3301,1603500,1309,2,13.52,1,6.76,1
289,3,1110,7,3301,1603500,30571,7,43.75,1,6.25,6
...,...,...,...,...,...,...,...,...,...,...,...
7974381,8,1173,4,6609,4487364,5380,8,67.36,1,8.42,7
7974392,8,1173,4,6609,4543034,1220,4,30.80,4,30.80,0
7974395,8,1173,4,6609,4543034,1250,9,69.30,2,15.40,7
7974400,8,1173,4,6609,4543034,5337,4,37.08,2,18.54,2
7974401,8,1173,4,6609,4543034,5380,10,84.20,2,16.84,8

### Test data

In [44]:
dfts = pd.read_csv("../data/df_[test]_small.csv")

In [45]:
dfts

         Semana  Agencia_ID  Canal_ID  Ruta_SAK  Cliente_ID  Producto_ID
0             9        1110         7      3301       15766         1212
1             9        1110         7      3301       15766         1238
2             9        1110         7      3301       15766         1240
3             9        1110         7      3301       15766         1242
4             9        1110         7      3301       15766         1250
...         ...         ...       ...       ...         ...          ...
1337908       9        1173         4      6609     4549706         5310
1337909       9        1173         4      6609     4549706        31717
1337910       9        1173         4      6609     4549706        40447
1337911       9        1173         4      6609     4549706        40450
1337912       9        1173         4      6609     4549706        46772

[1337913 rows x 6 columns]

---

## Additional Notes

---
---